taisirou/ArduinoCore-mbed/boards.txt
nicla_sense.build.variant=NICLA
nicla_sense.build.mcu=cortex-m4
nicla_sense.build.extra_flags=
nicla_sense.build.architecture=cortex-m4
nicla_sense.build.fpu=-mfpu=fpv4-sp-d16
nicla_sense.build.float-abi=-mfloat-abi=softfp
nicla_sense.build.board=NICLA
nicla_sense.build.ldscript=linker_script.ld
nicla_sense.compiler.mbed.arch.define=-DARDUINO_ARCH_NRF52832
nicla_sense.compiler.mbed.defines={build.variant.path}/defines.txt
nicla_sense.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
nicla_sense.compiler.mbed.cflags={build.variant.path}/cflags.txt
nicla_sense.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
nicla_sense.compiler.mbed.includes={build.variant.path}/includes.txt
nicla_sense.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
nicla_sense.compiler.mbed="{build.variant.path}/libs/libmbed.a"
nicla_sense.vid.0=0x2341
nicla_sense.pid.0=0x0060
nicla_sense.upload_port.0.vid=0x2341
nicla_sense.upload_port.0.pid=0x0060

nicla_sense.upload.tool=openocd
nicla_sense.upload.tool.default=openocd
nicla_sense.upload.protocol=
nicla_sense.upload.config=-f target/nrf52.cfg
nicla_sense.upload.programmer=-f interface/cmsis-dap.cfg
nicla_sense.upload.transport=-c "transport select swd; adapter speed 1000"
nicla_sense.upload.use_1200bps_touch=false
nicla_sense.upload.wait_for_upload_port=true
nicla_sense.upload.native_usb=true
nicla_sense.upload.maximum_size=527616
nicla_sense.upload.maximum_data_size=64288

nicla_sense.bootloader.tool=openocd
nicla_sense.bootloader.tool.default=openocd
nicla_sense.bootloader.extra_action.preflash=echo INFO:removed_mass-erase
nicla_sense.bootloader.config=-f target/nrf52.cfg
nicla_sense.bootloader.programmer=-f interface/cmsis-dap.cfg
nicla_sense.bootloader.file=NICLA/bootloader.hex

##############################################################

pico.name=Maker Pi RP2040
pico.build.core=arduino
pico.build.crossprefix=arm-none-eabi-
pico.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

pico.build.variant=Maker_Pi_RP2040
pico.build.mcu=cortex-m0plus
pico.build.extra_flags=
pico.build.fpu=
pico.build.float-abi=
pico.build.architecture=cortex-m0plus
pico.build.board=Maker_Pi_RP2040
pico.build.ldscript=linker_script.ld
pico.compiler.mbed.arch.define=-DARDUINO_ARCH_RP2040
pico.compiler.mbed.defines={build.variant.path}/defines.txt
pico.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
pico.compiler.mbed.cflags={build.variant.path}/cflags.txt
pico.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
pico.compiler.mbed.includes={build.variant.path}/includes.txt
pico.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
pico.compiler.mbed="{build.variant.path}/libs/libmbed.a"
pico.vid.0=0x2e8a
pico.pid.0=0x00C0
pico.upload_port.0.vid=0x2e8a
pico.upload_port.0.pid=0x00C0

pico.upload.tool=picotool
pico.upload.tool.default=picotool
pico.upload.protocol=
pico.upload.transport=
pico.upload.use_1200bps_touch=true
pico.upload.wait_for_upload_port=false
pico.upload.native_usb=true
pico.upload.maximum_size=16777216
pico.upload.maximum_data_size=270336

pico.bootloader.tool=openocd
pico.bootloader.tool.default=openocd
pico.bootloader.config=-f target/rp2040.cfg
pico.bootloader.programmer=-f interface/cmsis-dap.cfg

##############################################################
mkpi.name=Maker Pi RP2040
mkpi.build.core=arduino
mkpi.build.crossprefix=arm-none-eabi-
mkpi.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

mkpi.build.variant=Maker_Pi_RP2040
mkpi.build.mcu=cortex-m0plus
mkpi.build.extra_flags=
mkpi.build.fpu=
mkpi.build.float-abi=
mkpi.build.architecture=cortex-m0plus
mkpi.build.board=Maker_Pi_RP2040
mkpi.build.ldscript=linker_script.ld
mkpi.compiler.mbed.arch.define=-DARDUINO_ARCH_RP2040
mkpi.compiler.mbed.defines={build.variant.path}/defines.txt
mkpi.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
mkpi.compiler.mbed.cflags={build.variant.path}/cflags.txt
mkpi.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
mkpi.compiler.mbed.includes={build.variant.path}/includes.txt
mkpi.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
mkpi.compiler.mbed="{build.variant.path}/libs/libmbed.a"
mkpi.vid.0=0x2e8a
mkpi.pid.0=0x00C0
mkpi.upload_port.0.vid=0x2e8a
mkpi.upload_port.0.pid=0x00C0

mkpi.upload.tool=picotool
mkpi.upload.tool.default=picotool
mkpi.upload.protocol=
mkpi.upload.transport=
mkpi.upload.use_1200bps_touch=true
mkpi.upload.wait_for_upload_port=false
mkpi.upload.native_usb=true
mkpi.upload.maximum_size=16777216
mkpi.upload.maximum_data_size=270336

mkpi.bootloader.tool=openocd
mkpi.bootloader.tool.default=openocd
mkpi.bootloader.config=-f target/rp2040.cfg
mkpi.bootloader.programmer=-f interface/cmsis-dap.cfg

##############################################################

